OpenFOAM/foam9tutorials/interfluo/OpenFOAM-pulsingJet_cases/2d_jet_coarse/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
                             
                     
scale   1;

vertices
(
	// face 1
	(-3.0 3.00 -6) //0
	(-3.0 0.10 -6) //1
	(-3.0 -0.1 -6) //2
	(-3.0 -3.0 -6) //3
	(-0.1 -3.0 -6) //4
	(0.10 -3.0 -6) //5
	(3.00 -3.0 -6) //6
	(3.00 -0.1 -6) //7
	(3.00 0.10 -6) //8
	(3.00 3.00 -6) //9
	(0.10 3.00 -6) //10
	(-0.1 3.00 -6) //11
	(-0.1 0.10 -6) //12
	(-0.1 -0.1 -6) //13
	(0.10 -0.1 -6) //14
	(0.10 0.10 -6) //15

	// face 2
	(-3.0 3.00 6.) //16
	(-3.0 0.10 6.) //17
	(-3.0 -0.1 6.) //18
	(-3.0 -3.0 6.) //19
	(-0.1 -3.0 6.) //20
	(0.10 -3.0 6.) //21
	(3.00 -3.0 6.) //22
	(3.00 -0.1 6.) //23
	(3.00 0.10 6.) //24
	(3.00 3.00 6.) //25
	(0.10 3.00 6.) //26
	(-0.1 3.00 6.) //27
	(-0.1 0.10 6.) //28
	(-0.1 -0.1 6.) //29
	(0.10 -0.1 6.) //30
	(0.10 0.10 6.) //31
);

//2:30:120
blocks
(

	hex (13 4 5 14 29 20 21 30) (60 1 240) simpleGrading (1 1 1)    //4
	hex (11 12 15 10 27 28 31 26) (60 1 240) simpleGrading (1 1 1)  //8
	hex (12 13 14 15 28 29 30 31) (7 1 240) simpleGrading (1 1 1)   //9
);

edges
(
);

boundary
(

	inlet
		{
			type patch;
			faces
				(
					(12 13 14 15)
				);
		}
	
	walls
		{
			type wall;
			faces
				(
					(10 11 12 15)
					(14 13 4 5)
					(10 11 27 26)
					(5 4 20 21)
				);
		}
	
	outlet
		{
			type patch;
			faces
				(
					(21 20 29 30)
					(28 29 30 31)
					(26 27 28 31)
				);
		}
	
	frontAndBack
		{
			type empty;
			faces
				(
					(21 30 14 5)
					(30 31 15 14)
					(31 26 10 15)
					(11 27 28 12)
					(28 29 13 12)
					(29 20 4 13)
				);
		}

);

mergePatchPairs
(
);

// ************************************************************************* //