OpenFOAM/foam9tutorials/interfluo/OpenFOAM-pulsingJet_cases/2d_jet_coarse/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          7;
        startFace       60593;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       60600;
    }
    outlet
    {
        type            patch;
        nFaces          127;
        startFace       61200;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          60960;
        startFace       61327;
    }
)

// ************************************************************************* //
